# DimensionPlaneNormal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..DimensionPlaneNormal Property
MultiReferenceAnnotationOptions Class See Also
---
The normal vector to the dimension plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ DimensionPlaneNormal { get; set; }
```

Visual Basic
---
```text
Public Property DimensionPlaneNormal As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ DimensionPlaneNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: dimensionPlaneNormal is not length 1.0. |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace